# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]


backbone:
    # [from, repeats, module, args]
    - [-1, 1, HGStem, [64, 128]]                  # 0-P2/4
    - [ -1, 1, RGCSPELAN, [ 128, 0.5 ] ]
    - [ -1, 1, DWConv, [ 256, 3, 2, 1, False ] ]  # 2-P3/8
    - [ -1, 1, RGCSPELAN, [ 256, 0.5 ] ]
    - [ -1, 1, DWConv, [ 384, 3, 2, 1, False ] ]  # 4-P4/16
    - [ -1, 1, RGCSPELAN, [ 384, 1.0 ] ]
    - [ -1, 1, DWConv, [ 384, 3, 2, 1, False ] ]  # 6-P5/32
    - [ -1, 3, RGCSPELAN, [ 384, 1.0 ] ]

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 input_proj.2
  - [-1, 1, AIFI, [768, 8]] # 9
  - [-1, 1, Conv, [256, 1, 1]]  # 10, Y5, lateral_convs.0

  - [ -1, 1, ChannelAttention_HSFPN, [ ] ] # 11
  - [ -1, 1, nn.Conv2d, [ 256, 1 ] ] # 12
  - [ -1, 1, nn.ConvTranspose2d, [ 256, 3, 2, 1, 1 ] ] # 13

  - [ 5, 1, ChannelAttention_HSFPN, [ ] ] # 14
  - [ -1, 1, nn.Conv2d, [ 256, 1 ] ] # 15
  - [ 13, 1, ChannelAttention_HSFPN, [ 4, False ] ] # 16
  - [ [ -1, -2 ], 1, Multiply, [ ] ] # 17
  - [ [ -1, 13 ], 1, Add, [ ] ] # 18
  - [-1, 3, RepC3, [256, 0.5]]  # 19 P4/16

  - [ 13, 1, nn.ConvTranspose2d, [ 256, 3, 2, 1, 1, 16 ] ] # 20
  - [ 3, 1, ChannelAttention_HSFPN, [ ] ] # 21
  - [ 1, 1, ChannelAttention_HSFPN, [ ] ] #22
  - [-1, 1, SPDConv, [128]] #23
  - [[-1, -3], 1,  MFM, [256]] #24
  - [-1, 1, CSPOmniKernel, []]  #25
  - [ -1, 1, nn.Conv2d, [ 256, 1 ] ]  # 26
  - [ 20, 1, ChannelAttention_HSFPN, [ 4, False ] ] # 27
  - [ [ -1, -2 ], 1, Multiply, [ ] ] # 28
  - [ [ -1, 20 ], 1, Add, [ ] ] # 29
  - [-1, 3, RepC3, [256, 0.5]]   # 30 P3/8

  - [ -1, 1, nn.Conv2d, [ 256, 3, 2, 1 ] ] # 31
  - [ 19, 1, ChannelAttention_HSFPN, [ ] ] # 32
  - [ -1, 1, nn.Conv2d, [ 256, 1 ] ] # 33
  - [ 31, 1, ChannelAttention_HSFPN, [ 4, False ] ] # 34
  - [ [ -1, -2 ], 1, Multiply, [ ] ] # 35
  - [ [ -1, 31 ], 1, Add, [ ] ] # 36
  - [-1, 2, RepC3, [256, 0.5]]  # 37 P4/16

  - [ 31, 1, nn.Conv2d, [ 256, 3, 2, 1 ] ] # 38
  - [ 12, 1, ChannelAttention_HSFPN, [ ] ] # 39
  - [ -1, 1, nn.Conv2d, [ 256, 1 ] ] # 40
  - [ 38, 1, ChannelAttention_HSFPN, [ 4, False ] ] # 41
  - [ [ -1, -2 ], 1, Multiply, [ ] ] # 42
  - [ [ -1, 38 ], 1, Add, [ ] ] # 43
  - [-1, 2, RepC3, [256, 0.5]]   # 44 P5/32

  - [ [ 30, 37, 44 ], 1, RTDETRDecoder, [ nc, 256, 150, 3, 8, 4 ] ]  # Detect(P3, P4, P5)
